In [167]:
import pandas as pd
import numpy as np

In [168]:
df = pd.DataFrame({"이름":["김길동","홍길동","박길동"],
                   "나이":[20,30,40],
                   "특기":["파이썬","JS","C"]})
df

    이름  나이   특기
0  김길동  20  파이썬
1  홍길동  30   JS
2  박길동  40    C

In [169]:
df.set_index("나이")
df  # set_index()는 원본데이터를 변화시키지 않음(=새로운 개체생성), 필요시 inplace=True 인수 사용

    이름  나이   특기
0  김길동  20  파이썬
1  홍길동  30   JS
2  박길동  40    C

In [170]:
li = ["김이최", 50, "C#"]

# df.iloc[3] = li # IndexError: iloc cannot enlarge its target object
df.loc[3] = li  # 행추가 : loc 활용(iloc은 확장불가)
df

    이름  나이   특기
0  김길동  20  파이썬
1  홍길동  30   JS
2  박길동  40    C
3  김이최  50   C#

In [171]:
df1 = pd.DataFrame([["김길동",20,"파이썬"],
                   ["홍길동",30,"JS"],
                   ["박길동",40,"C"]],  # Dict아닌 List형식 데이터프레임 구성 : [[],[],[],...]
                   columns=["이름","나이","특기"]) # Dick과 달리 필요시 columns 별도 설정
'''
1.Dict형태로 df 구성하는것이 자료관리 측면에서 편리할 것 같음
2.Row 단위로 입력/추가 하는경우 list형태로 추가하는것이 편리할 것 같음
'''
df1

    이름  나이   특기
0  김길동  20  파이썬
1  홍길동  30   JS
2  박길동  40    C

In [172]:
df1.rename(columns={"이름":"name"}, index={2:3})  # columns/index 변경시 rename()
# df.columns = [] 로 변경도 가능함
# df.index = []

# df.rename(columns={:}, index={:})은 인자의 Dict 형태를 통해 매치시켜서 변경할 수 있음

  name  나이   특기
0  김길동  20  파이썬
1  홍길동  30   JS
3  박길동  40    C

In [173]:
df1.drop(2, axis=0) # 행이름는 3일지라도 인덱스는 2, axis=0 은 생략가능

    이름  나이   특기
0  김길동  20  파이썬
1  홍길동  30   JS

In [174]:
df.drop(df.columns[2], axis=1)  # 열이름 직접입력해도 되고, 이와같이 입력해도 됨

    이름  나이
0  김길동  20
1  홍길동  30
2  박길동  40
3  김이최  50

In [175]:
df

    이름  나이   특기
0  김길동  20  파이썬
1  홍길동  30   JS
2  박길동  40    C
3  김이최  50   C#

In [176]:
df.columns = ['name','age','skill']
df

  name  age skill
0  김길동   20   파이썬
1  홍길동   30    JS
2  박길동   40     C
3  김이최   50    C#

In [177]:
df.index = [1,2,3,4]
df

  name  age skill
1  김길동   20   파이썬
2  홍길동   30    JS
3  박길동   40     C
4  김이최   50    C#

In [178]:
df.to_numpy() # numpy 배열로 가져옴

array([['김길동', 20, '파이썬'],
       ['홍길동', 30, 'JS'],
       ['박길동', 40, 'C'],
       ['김이최', 50, 'C#']], dtype=object)

In [179]:
df.to_numpy().tolist()  # numpy 배열을 리스트로 가져옴

[['김길동', 20, '파이썬'], ['홍길동', 30, 'JS'], ['박길동', 40, 'C'], ['김이최', 50, 'C#']]

In [180]:
df['name']  # name 열을 시리즈형태로 가져옴

1    김길동
2    홍길동
3    박길동
4    김이최
Name: name, dtype: object

In [181]:
df[['name']]  # name열을 DataFrame형태로 가져옴

  name
1  김길동
2  홍길동
3  박길동
4  김이최

In [182]:
df

  name  age skill
1  김길동   20   파이썬
2  홍길동   30    JS
3  박길동   40     C
4  김이최   50    C#

In [183]:
df['age'] += 10   # 시리즈 연산
df

  name  age skill
1  김길동   30   파이썬
2  홍길동   40    JS
3  박길동   50     C
4  김이최   60    C#

In [184]:
df[df['age'] > 50]  # 열을 기준으로 필터링

  name  age skill
4  김이최   60    C#

In [185]:
df.sort_values(by='age', ascending=False, inplace=True) # 열을 기준으로 정렬, ascending=False : 내림차순
df

  name  age skill
4  김이최   60    C#
3  박길동   50     C
2  홍길동   40    JS
1  김길동   30   파이썬

In [186]:
df.index = [1,2,3,4]  # reset_index()하지 않고, 인덱스 직접수정

In [192]:
df.reset_index(inplace=True)  # reset_index() index가 리셋되고, 기존의인덱스가 첫번째 열로 오게됨
df

   index name  age skill
0      0  김이최   60    C#
1      1  박길동   50     C
2      2  홍길동   40    JS
3      3  김길동   30   파이썬

In [193]:
df.drop('index', axis=1, inplace=True)  # 새로 생겨버린 index 열 drop()으로 삭제

In [194]:
df

  name  age skill
0  김이최   60    C#
1  박길동   50     C
2  홍길동   40    JS
3  김길동   30   파이썬

In [218]:
def plus10(n):
  return n + 10

df['age'] = df['age'].apply(plus10) # 열(시리즈)에 함수 적용 apply(), 원본을 변경하지 않음

df

  name  age skill
0  김이최   80    C#
1  박길동   70     C
2  홍길동   60    JS
3  김길동   50   파이썬

In [228]:
df1

    이름  나이   특기
0  김길동  20  파이썬
1  홍길동  30   JS
2  박길동  40    C

In [229]:

df1.to_numpy().tolist()

[['김길동', 20, '파이썬'], ['홍길동', 30, 'JS'], ['박길동', 40, 'C']]